adamkondraciuk/nrfx/mdk/nrf54h20_enga_secure_peripherals.h
/*CM33 SubSystem*/
#define CM33SS_PRESENT 1
#define CM33SS_COUNT 1

#define CPUC_FPUAVAILABLE 0                          /*!< (unspecified)                                                        */

/*Cache*/
#define CACHE_PRESENT 1
#define CACHE_COUNT 2

#define ICACHE_VIRTUALCACHE 0                        /*!< (unspecified)                                                        */
#define ICACHE_FLUSH 1                               /*!< (unspecified)                                                        */
#define ICACHE_CLEAN 0                               /*!< (unspecified)                                                        */

#define DCACHE_VIRTUALCACHE 0                        /*!< (unspecified)                                                        */
#define DCACHE_FLUSH 1                               /*!< (unspecified)                                                        */
#define DCACHE_CLEAN 1                               /*!< (unspecified)                                                        */

/*System protection unit*/
#define SPU_PRESENT 1
#define SPU_COUNT 16

#define SPU000_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU000_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU000_DPPI 0                                /*!< (unspecified)                                                        */
#define SPU000_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU000_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU000_GPIO 0                                /*!< (unspecified)                                                        */

#define SPU010_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU010_IPCT 1                                /*!< (unspecified)                                                        */
#define SPU010_DPPI 0                                /*!< (unspecified)                                                        */
#define SPU010_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU010_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU010_GPIO 0                                /*!< (unspecified)                                                        */

#define SPU200_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU200_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU200_DPPI 0                                /*!< (unspecified)                                                        */
#define SPU200_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU200_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU200_GPIO 0                                /*!< (unspecified)                                                        */

#define SPU110_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU110_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU110_DPPI 0                                /*!< (unspecified)                                                        */
#define SPU110_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU110_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU110_GPIO 0                                /*!< (unspecified)                                                        */

#define SPU111_BELLS 1                               /*!< (unspecified)                                                        */
#define SPU111_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU111_DPPI 0                                /*!< (unspecified)                                                        */
#define SPU111_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU111_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU111_GPIO 0                                /*!< (unspecified)                                                        */

#define SPU120_BELLS 1                               /*!< (unspecified)                                                        */
#define SPU120_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU120_DPPI 0                                /*!< (unspecified)                                                        */
#define SPU120_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU120_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU120_GPIO 0                                /*!< (unspecified)                                                        */

#define SPU121_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU121_IPCT 1                                /*!< (unspecified)                                                        */
#define SPU121_DPPI 0                                /*!< (unspecified)                                                        */
#define SPU121_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU121_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU121_GPIO 0                                /*!< (unspecified)                                                        */

#define SPU122_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU122_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU122_DPPI 1                                /*!< (unspecified)                                                        */
#define SPU122_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU122_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU122_GPIO 0                                /*!< (unspecified)                                                        */

#define SPU130_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU130_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU130_DPPI 0                                /*!< (unspecified)                                                        */
#define SPU130_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU130_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU130_GPIO 0                                /*!< (unspecified)                                                        */

#define SPU131_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU131_IPCT 1                                /*!< (unspecified)                                                        */
#define SPU131_DPPI 1                                /*!< (unspecified)                                                        */
#define SPU131_GPIOTE 1                              /*!< (unspecified)                                                        */
#define SPU131_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU131_GPIO 1                                /*!< (unspecified)                                                        */

#define SPU132_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU132_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU132_DPPI 1                                /*!< (unspecified)                                                        */
#define SPU132_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU132_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU132_GPIO 0                                /*!< (unspecified)                                                        */

#define SPU133_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU133_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU133_DPPI 1                                /*!< (unspecified)                                                        */
#define SPU133_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU133_GRTC 1                                /*!< (unspecified)                                                        */
#define SPU133_GPIO 0                                /*!< (unspecified)                                                        */

#define SPU134_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU134_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU134_DPPI 1                                /*!< (unspecified)                                                        */
#define SPU134_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU134_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU134_GPIO 0                                /*!< (unspecified)                                                        */

#define SPU135_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU135_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU135_DPPI 1                                /*!< (unspecified)                                                        */
#define SPU135_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU135_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU135_GPIO 0                                /*!< (unspecified)                                                        */

#define SPU136_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU136_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU136_DPPI 1                                /*!< (unspecified)                                                        */
#define SPU136_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU136_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU136_GPIO 0                                /*!< (unspecified)                                                        */

#define SPU137_BELLS 0                               /*!< (unspecified)                                                        */
#define SPU137_IPCT 0                                /*!< (unspecified)                                                        */
#define SPU137_DPPI 1                                /*!< (unspecified)                                                        */
#define SPU137_GPIOTE 0                              /*!< (unspecified)                                                        */
#define SPU137_GRTC 0                                /*!< (unspecified)                                                        */
#define SPU137_GPIO 0                                /*!< (unspecified)                                                        */

/*Memory Privilege Controller*/
#define MPC_PRESENT 1
#define MPC_COUNT 6

#define MPC000_EXTEND_CLOCK_REQ 0                    /*!< (unspecified)                                                        */
#define MPC000_RTCHOKE 0                             /*!< (unspecified)                                                        */
#define MPC000_OVERRIDE_GRAN 4                       /*!< The override region granularity is 4 bytes                           */

#define MPC200_EXTEND_CLOCK_REQ 0                    /*!< (unspecified)                                                        */
#define MPC200_RTCHOKE 0                             /*!< (unspecified)                                                        */
#define MPC200_OVERRIDE_GRAN 4                       /*!< The override region granularity is 4 bytes                           */

