adamkondraciuk/nrfx/mdk/nrf54h20_enga_secure_peripherals.h
#define UARTE120_EASYDMA_MAXCNT_SIZE_MIN 0           /*!< (unspecified)                                                        */
#define UARTE120_EASYDMA_MAXCNT_SIZE_MAX 7           /*!< (unspecified)                                                        */
#define UARTE120_EASYDMA5 0                          /*!< (unspecified)                                                        */
#define UARTE120_EASYDMATEMP 1                       /*!< (unspecified)                                                        */
#define UARTE120_EASYDMALISTINCLUDED 0               /*!< (unspecified)                                                        */
#define UARTE120_EASYDMAMODEINCLUDED 0               /*!< (unspecified)                                                        */
#define UARTE120_EASYDMAFULLLPMODEINCLUDED 0         /*!< (unspecified)                                                        */

#define UARTE130_EASYDMA_MAXCNT_SIZE_MIN 0           /*!< (unspecified)                                                        */
#define UARTE130_EASYDMA_MAXCNT_SIZE_MAX 7           /*!< (unspecified)                                                        */
#define UARTE130_EASYDMA5 0                          /*!< (unspecified)                                                        */
#define UARTE130_EASYDMATEMP 1                       /*!< (unspecified)                                                        */
#define UARTE130_EASYDMALISTINCLUDED 0               /*!< (unspecified)                                                        */
#define UARTE130_EASYDMAMODEINCLUDED 0               /*!< (unspecified)                                                        */
#define UARTE130_EASYDMAFULLLPMODEINCLUDED 0         /*!< (unspecified)                                                        */

#define UARTE131_EASYDMA_MAXCNT_SIZE_MIN 0           /*!< (unspecified)                                                        */
#define UARTE131_EASYDMA_MAXCNT_SIZE_MAX 7           /*!< (unspecified)                                                        */
#define UARTE131_EASYDMA5 0                          /*!< (unspecified)                                                        */
#define UARTE131_EASYDMATEMP 1                       /*!< (unspecified)                                                        */
#define UARTE131_EASYDMALISTINCLUDED 0               /*!< (unspecified)                                                        */
#define UARTE131_EASYDMAMODEINCLUDED 0               /*!< (unspecified)                                                        */
#define UARTE131_EASYDMAFULLLPMODEINCLUDED 0         /*!< (unspecified)                                                        */

#define UARTE132_EASYDMA_MAXCNT_SIZE_MIN 0           /*!< (unspecified)                                                        */
#define UARTE132_EASYDMA_MAXCNT_SIZE_MAX 7           /*!< (unspecified)                                                        */
#define UARTE132_EASYDMA5 0                          /*!< (unspecified)                                                        */
#define UARTE132_EASYDMATEMP 1                       /*!< (unspecified)                                                        */
#define UARTE132_EASYDMALISTINCLUDED 0               /*!< (unspecified)                                                        */
#define UARTE132_EASYDMAMODEINCLUDED 0               /*!< (unspecified)                                                        */
#define UARTE132_EASYDMAFULLLPMODEINCLUDED 0         /*!< (unspecified)                                                        */

#define UARTE133_EASYDMA_MAXCNT_SIZE_MIN 0           /*!< (unspecified)                                                        */
#define UARTE133_EASYDMA_MAXCNT_SIZE_MAX 7           /*!< (unspecified)                                                        */
#define UARTE133_EASYDMA5 0                          /*!< (unspecified)                                                        */
#define UARTE133_EASYDMATEMP 1                       /*!< (unspecified)                                                        */
#define UARTE133_EASYDMALISTINCLUDED 0               /*!< (unspecified)                                                        */
#define UARTE133_EASYDMAMODEINCLUDED 0               /*!< (unspecified)                                                        */
#define UARTE133_EASYDMAFULLLPMODEINCLUDED 0         /*!< (unspecified)                                                        */

#define UARTE134_EASYDMA_MAXCNT_SIZE_MIN 0           /*!< (unspecified)                                                        */
#define UARTE134_EASYDMA_MAXCNT_SIZE_MAX 7           /*!< (unspecified)                                                        */
#define UARTE134_EASYDMA5 0                          /*!< (unspecified)                                                        */
#define UARTE134_EASYDMATEMP 1                       /*!< (unspecified)                                                        */
#define UARTE134_EASYDMALISTINCLUDED 0               /*!< (unspecified)                                                        */
#define UARTE134_EASYDMAMODEINCLUDED 0               /*!< (unspecified)                                                        */
#define UARTE134_EASYDMAFULLLPMODEINCLUDED 0         /*!< (unspecified)                                                        */

#define UARTE135_EASYDMA_MAXCNT_SIZE_MIN 0           /*!< (unspecified)                                                        */
#define UARTE135_EASYDMA_MAXCNT_SIZE_MAX 7           /*!< (unspecified)                                                        */
#define UARTE135_EASYDMA5 0                          /*!< (unspecified)                                                        */
#define UARTE135_EASYDMATEMP 1                       /*!< (unspecified)                                                        */
#define UARTE135_EASYDMALISTINCLUDED 0               /*!< (unspecified)                                                        */
#define UARTE135_EASYDMAMODEINCLUDED 0               /*!< (unspecified)                                                        */
#define UARTE135_EASYDMAFULLLPMODEINCLUDED 0         /*!< (unspecified)                                                        */

